000001         01 MERCHANT-CAT-DETAILES.
000002          03 REF-MERCHANT-CAT-CODE   PIC 9(04).
000003          03 REF-RISK-CODE           PIC X(01).
000004           88 REF-RISK-LOW      VALUE 'L'.
000005           88 REF-RISK-MEDIUM   VALUE 'M'.
000006           88 REF-RISK-HIGH     VALUE 'H'.
000007          03 REF-MAX-AMOUNT-CENTS    PIC 9(09).
000008        * RECL 14 
